#Program JX3
#Author: Feixiao_L
#======================================================================================
#剑网三配装的计量分析
#主体分析方法：梯度爬升
#======================================================================================
#治疗分析
Zhiliao = function(X1, X2, X3, k = 1){return(X1 * k * (1 + 0.75 * X2 / 4144 + X2 * X3 / 6245008))}
Zhiliao_P1 = function(X2, X3, k = 1){return(k * (1 + 0.75 * X2 / 4144 + X2 * X3 / 6245008))}
Zhiliao_P2 = function(X1, X3, k = 1){return(X1 * k * (0.75 / 4144 + X3 / 6245008))}
Zhiliao_P3 = function(X1, X2, k = 1){return(X1 * k * X2 / 6245008)}








